smuuze/rpi_control_rp2040/src/driver/clock_driver_rp2040.c
/**
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 *
 * @file    clock_driver_RP2040.c
 * @author  Sebastian Lesse
 * @date    2022 / 07 / 25
 * @brief   Initialization of the clock-module of the Raspberry Pi Pico
 * 
 */

#define TRACER_OFF

// --------------------------------------------------------------------------------

#ifdef TRACER_ON
#warning __WARNING__TRACER_ENABLED__WARNING__
#endif

// --------------------------------------------------------------------------------

#include "config.h"

// --------------------------------------------------------------------------------

#include "tracer.h"

// --------------------------------------------------------------------------------

#include "cpu.h"

// --------------------------------------------------------------------------------

#include "rp2040_reset.h"

// --------------------------------------------------------------------------------

#include BOARD_DESCRIPTION_FILE

// --------------------------------------------------------------------------------

#include "driver/clock/clock_driver_interface.h"

// --------------------------------------------------------------------------------

/**
 * @brief Basse-address of the watchdog control-register of the RP2040
 */
#define RP2040_WATCHDOG_REG_BASE_ADDRESS    __UNSIGNED(0x40058000)

// --------------------------------------------------------------------------------

/**
 * @brief Basse-address of the clock control-register of the RP2040
 */
#define RP2040_CLOCK_REG_BASE_ADDRESS       __UNSIGNED(0x40008000)

// --------------------------------------------------------------------------------

/**
 * @brief Basse-address of the XOSC control-register of the RP2040
 */
#define RP2040_XOSC_REG_BASE_ADDRESS        __UNSIGNED(0x40024000)

// --------------------------------------------------------------------------------

/**
 * @brief Basse-address of the SYS-PLL control-register of the RP2040
 */
#define RP2040_PLL_SYS_BASE_ADDRESS         __UNSIGNED(0x40028000)

// --------------------------------------------------------------------------------

/**
 * @brief Basse-address of the USB-PLL control-register of the RP2040
 */
#define RP2040_PLL_USB_BASE_ADDRESS         __UNSIGNED(0x4002c000)

// --------------------------------------------------------------------------------

#define WATCHDOG_REG_TICK_ENABLE            __UNSIGNED(0x00000200)

// --------------------------------------------------------------------------------

#ifndef MHZ
#define MHZ(clk)    (clk * 1000000)
#endif

// --------------------------------------------------------------------------------

/**
 * @brief PICO_CONFIG: PICO_XOSC_STARTUP_DELAY_MULTIPLIER,
 * Multiplier to lengthen xosc startup delay to accommodate slow-starting oscillators,
 * type=int, min=1, default=1, group=hardware_xosc
 * 
 */
#ifndef RP2040_CLOCK_DRIVER_XOSC_STARTUP_DELAY_MULTIPLIER
#define RP2040_CLOCK_DRIVER_XOSC_STARTUP_DELAY_MULTIPLIER  __UNSIGNED(1)
#endif

/**
 * @brief PICO_CONFIG: XOSC_MHZ
 * The crystal oscillator frequency in Mhz,
 * type=int, default=12, advanced=true, group=hardware_base
 * 
 */
#ifndef XOSC_MHZ
#define XOSC_MHZ    __UNSIGNED(12)
#endif

// --------------------------------------------------------------------------------

#define RP2040_CLOCK_DRIVER_XOSC_CTRL_ENABLE_LSB                    __UNSIGNED(12)

#define RP2040_CLOCK_DRIVER_XOSC_CTRL_FREQ_RANGE_VALUE_1_15MHZ      __UNSIGNED(0xaa0)
#define RP2040_CLOCK_DRIVER_XOSC_CTRL_ENABLE                        (__UNSIGNED(0xfab) << RP2040_CLOCK_DRIVER_XOSC_CTRL_ENABLE_LSB)
#define RP2040_CLOCK_DRIVER_XOSC_STATUS_STABLE                      __UNSIGNED(0x80000000)

#define RP2040_CLOCK_DRIVER_XOSC_STARTUP_DELAY                      (((( MHZ(XOSC_MHZ) / 1000) + 128) / 256) * RP2040_CLOCK_DRIVER_XOSC_STARTUP_DELAY_MULTIPLIER)

// --------------------------------------------------------------------------------

#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS     __UNSIGNED(0x0)
#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX    __UNSIGNED(0x1)
#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC           __UNSIGNED(0x2)

#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS           __UNSIGNED(0x0)
#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_RTC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB     __UNSIGNED(0x0)
#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB     __UNSIGNED(0x0)
#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB     __UNSIGNED(0x0)

#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_BITS                        __UNSIGNED(0x00000003)

#define RP2040_CLOCK_CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS                         __UNSIGNED(0x00000800)

#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_AUXSRC_LSB                      __UNSIGNED(5)
#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_AUXSRC_BITS                     __UNSIGNED(0x000000e0)

#define RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_LSB                         __UNSIGNED(0)

// --------------------------------------------------------------------------------

/**
 * @brief Selects the clock source glitchlessly, can be changed on- the-fly
 * 
 */
#define RP2040_CLOCK_DRIVER_SYS_CTRL_REG_SRC        __UNSIGNED(0x00000001)
#define RP2040_CLOCK_DRIVER_REF_CTRL_REG_SRC        __UNSIGNED(0x00000003)

// --------------------------------------------------------------------------------

/**
 * @brief Number of clocks available on the RP2040
 * 
 */
#define RP2040_CLOCK_COUNT              __UNSIGNED(10)

