smuuze/rpi_control_rp2040/src/driver/clock_driver_rp2040.c
#define RP2040_CLOCK_DRIVER_SRC_GPOUT0  __UNSIGNED(0)
#define RP2040_CLOCK_DRIVER_SRC_GPOUT1  __UNSIGNED(1)
#define RP2040_CLOCK_DRIVER_SRC_GPOUT2  __UNSIGNED(2)
#define RP2040_CLOCK_DRIVER_SRC_GPOUT3  __UNSIGNED(3)
#define RP2040_CLOCK_DRIVER_SRC_REF     __UNSIGNED(4)
#define RP2040_CLOCK_DRIVER_SRC_SYS     __UNSIGNED(5)
#define RP2040_CLOCK_DRIVER_SRC_PERI    __UNSIGNED(6)
#define RP2040_CLOCK_DRIVER_SRC_USB     __UNSIGNED(7)
#define RP2040_CLOCK_DRIVER_SRC_ADC     __UNSIGNED(8)
#define RP2040_CLOCK_DRIVER_SRC_RTC     __UNSIGNED(9)

// --------------------------------------------------------------------------------

#define RP2040_CLOCK_DRIVER_PLL_PRIM_POSTDIV1_LSB    __UNSIGNED(16)
#define RP2040_CLOCK_DRIVER_PLL_PRIM_POSTDIV2_LSB    __UNSIGNED(12)

#define RP2040_CLOCK_DRIVER_PLL_PWR_POWER_DOWN      __UNSIGNED(0x00000001)
#define RP2040_CLOCK_DRIVER_PLL_PWR_VCO_POWER_DOWN  __UNSIGNED(0x00000020)
#define RP2040_CLOCK_DRIVER_PLL_CS_LOCK             __UNSIGNED(0x80000000)
#define RP2040_CLOCK_DRIVERPLL_PWR_POSTDIVPD        __UNSIGNED(0x00000008)

#define RP2040_CLOCK_DRIVER_IS_GLITCHLESS_MUX(clk_index)    (clk_index == RP2040_CLOCK_DRIVER_SRC_SYS || clk_index == RP2040_CLOCK_DRIVER_SRC_REF)

// --------------------------------------------------------------------------------

/**
 * @brief Structure to control the XOSC register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {
    
    /**
     * @brief Crystal Oscillator Control
     * See datasheet ch. 2.16.7 page 242-243
     * 
     */
    io_rw_32 ctrl;

    /**
     * @brief Crystal Oscillator Status
     * See datasheet ch. 2.16.7 page 242-243
     * 
     */
    io_rw_32 status;

    /**
     * @brief Crystal Oscillator pause control
     * See datasheet ch. 2.16.7 page 243-244
     * 
     */
    io_rw_32 dormant;

    /**
     * @brief Controls the startup delay
     * See datasheet ch. 2.16.7 page 244
     * 
     */
    io_rw_32 startup;

    uint32_t _pad0[3];

    /**
     * @brief A down counter running at the xosc frequency which counts to zero and stops
     * See datasheet ch. 2.16.7 page 244
     * 
     */
    io_rw_32 count;

} RP2040_XOSC_REG;

// --------------------------------------------------------------------------------

/**
 * @brief Structure to control the CLOCK-PLL register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {
    
    /**
     * @brief Control and Status
     * See datasheet ch. 2.18.4 page 256
     * 
     */
    io_rw_32 cs;

    /**
     * @brief Controls the PLL power modes
     * See datasheet ch. 2.18.4 page 256
     * 
     */
    io_rw_32 pwr;

    /**
     * @brief Feedback divisor
     * See datasheet ch. 2.18.4 page 256-257
     * 
     */
    io_rw_32 fbdiv_int;

    /**
     * @brief Controls the PLL post dividers for the primary output
     * See datasheet ch. 2.18.4 page 257
     * 
     */
    io_rw_32 prim;

} RP2040_CLOCK_PLL_REG;

// --------------------------------------------------------------------------------

/**
 * @brief Sub-Structure to control the CLOCK-CONTROL and CLOCK-DEVIDER register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {
    
    /**
     * @brief Clock control, can be changed on-the-fly (except for auxsrc)
     * See datasheet ch. 2.15.7 page 220-231
     * 
     */
    io_rw_32 ctrl;

    /**
     * @brief Clock divisor, can be changed on-the-fly
     * See datasheet ch. 2.15.7 page 220-231
     * 
     */
    io_rw_32 div;

    /**
     * @brief Indicates which SRC is currently selected by the glitchless mux (one-hot).
     * See datasheet ch. 2.15.7 page 220-231
     * 
     */
    io_ro_32 selected;

} RP2040_CLOCK_CONTROL_REG;

// --------------------------------------------------------------------------------

/**
 * @brief Sub-Structure to control the CLOCK-FC0 register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {
    
    /**
     * @brief Reference clock frequency in kHz
     * See datasheet ch. 2.15.7 page 231
     * 
     */
    io_rw_32 ref_khz;

    /**
     * @brief Minimum pass frequency in kHz.
     * This is optional. Set to 0 if you are not using RW 0x0000000 the pass/fail flags
     * See datasheet ch. 2.15.7 page 232
     * 
     */
    io_rw_32 min_khz;

    /**
     * @brief Maximum pass frequency in kHz
     * This is optional. Set to 0x1ffffff if you are RW 0x1ffffff not using the pass/fail flags
     * See datasheet ch. 2.15.7 page 232
     * 
     */
    io_rw_32 max_khz;

    /**
     * @brief Delays the start of frequency counting to allow the mux to settle
     * Delay is measured in multiples of the reference clock period
     * See datasheet ch. 2.15.7 page 232
     * 
     */
    io_rw_32 delay;

    /**
     * @brief The test interval is 0.98us * 2**interval,
     * but let’s call it 1us * 2**interval
     * The default gives a test interval of 250us
     * See datasheet ch. 2.15.7 page 232
     * 
     */
    io_rw_32 interval;

    /**
     * @brief Clock sent to frequency counter, set to 0 when not required
     * See datasheet ch. 2.15.7 page 232-233
     * 
     */
    io_rw_32 src;

    /**
     * @brief Frequency counter status
     * See datasheet ch. 2.15.7 page 233
     * 
     */
    io_ro_32 status;

    /**
     * @brief Result of frequency measurement,
     * only valid when status_done=1
     * See datasheet ch. 2.15.7 page 233-234
     * 
     */
    io_ro_32 result;

} RP2040_CLOCK_FC0_REG;

// --------------------------------------------------------------------------------

/**
 * @brief Structure to control the CLOCK register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {

    RP2040_CLOCK_CONTROL_REG clk[RP2040_CLOCK_COUNT]; // 10

    /**
     * @brief enable / (force) clear of resus
     * See datasheet ch. 2.15.7 page 231
     * 
     */
    io_rw_32 resus_ctrl;

    /**
     * @brief Clock has been resuscitated, correct the error then send RO 0x0 ctrl_clear=1
     * See datasheet ch. 2.15.7 page 231
     * 
     */
    io_rw_32 resus_status;

    /**
     * @brief 
     * 
     */
    RP2040_CLOCK_FC0_REG fc0;

    /**
     * @brief enable clock in wake mode
     * See datasheet ch. 2.15.7 page 234
     * 
     */
    io_rw_32 wake_en0;

    /**
     * @brief enable clock in wake mode
     * See datasheet ch. 2.15.7 page 235
     * 
     */
    io_rw_32 wake_en1;

    /**
     * @brief enable clock in sleep mode
     * See datasheet ch. 2.15.7 page 235
     * 
     */
    io_rw_32 sleep_en0;

    /**
     * @brief enable clock in sleep mode
     * See datasheet ch. 2.15.7 page 236
     * 
     */
    io_rw_32 sleep_en1;

    /**
     * @brief indicates the state of the clock enable
     * See datasheet ch. 2.15.7 page 237
     * 
     */
    io_ro_32 enabled0;

    /**
     * @brief indicates the state of the clock enable
     * See datasheet ch. 2.15.7 page 238
     * 
     */
    io_ro_32 enabled1;

    /**
     * @brief Raw Interrupts
     * See datasheet ch. 2.15.7 page 239
     * 
     */
    io_ro_32 intr;

    /**
     * @brief Interrupt Enable
     * See datasheet ch. 2.15.7 page 239
     * 
     */
    io_rw_32 inte;

    /**
     * @brief Interrupt Force
     * See datasheet ch. 2.15.7 page 239
     * 
     */
    io_rw_32 intf;

    /**
     * @brief Interrupt status after masking & forcing
     * See datasheet ch. 2.15.7 page 239
     * 
     */
    io_ro_32 ints;

} RP2040_CLOCK_REG;

// --------------------------------------------------------------------------------

/**
 * @brief Structure to control the WATCHDOG register of the RP2040
 * @see RP2040 Datasheet (build-date: 2021-03-05 / build-version: 9bf4a25-clean)
 * 
 */
typedef struct {

    /**
     * @brief Watchdog control.
     * The rst_wdsel register determines which subsystems
     * are reset when the watchdog is triggered.
     * The watchdog can be triggered in software.
     * See datasheet ch. 4.7.6 page 568
     * 
     */
    io_rw_32 ctrl;

    /**
     * @brief Load the watchdog timer.
     * The maximum setting is 0xffffff which corresponds to 0xffffff / 2
     * ticks before triggering a watchdog reset (see errata RP2040-E1).
     * See datasheet ch. 4.7.6 page 569
     * 
     */
    io_wo_32 load;

    /**
     * @brief Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.
     * See datasheet ch. 4.7.6 page 569
     * 
     */
    io_ro_32 reason;

    /**
     * @brief Scratch register. Information persists through soft reset of the chip.
     * See datasheet ch. 4.7.6 page 569
     * 
     */
    io_rw_32 scratch[8];

    /**
     * @brief Controls the tick generator
     * See datasheet ch. 4.7.6 page 570
     * 
     */
    io_rw_32 tick;

} RP2040_WATCHDOG_REG;

// --------------------------------------------------------------------------------

/**
 * @brief Returns pointer to access the watchdog register
 * 
 * @return Pointer to the watchdog register
 */
static inline RP2040_WATCHDOG_REG* clock_driver_get_watchdog_reg(void) {
    return ((RP2040_WATCHDOG_REG*)RP2040_WATCHDOG_REG_BASE_ADDRESS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Returns pointer to access the clock register
 * 
 * @return Pointer to the clock register
 */
static inline RP2040_CLOCK_REG* clock_driver_get_clock_reg(void) {
    return ((RP2040_CLOCK_REG*)RP2040_CLOCK_REG_BASE_ADDRESS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Returns pointer to access the XOSC register
 * 
 * @return Pointer to the XOSC register
 */
static inline RP2040_XOSC_REG* clock_driver_get_xosc_reg(void) {
    return ((RP2040_XOSC_REG*)RP2040_XOSC_REG_BASE_ADDRESS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Returns pointer to access the USB-PLL register
 * 
 * @return Pointer to the USB-PLL register
 */
static inline RP2040_CLOCK_PLL_REG* clock_driver_get_usb_pll_reg(void) {
    return ((RP2040_CLOCK_PLL_REG*)RP2040_PLL_USB_BASE_ADDRESS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Returns pointer to access the SYS-PLL register
 * 
 * @return Pointer to the SYS-PLL register
 */
static inline RP2040_CLOCK_PLL_REG* clock_driver_get_sys_pll_reg(void) {
    return ((RP2040_CLOCK_PLL_REG*)RP2040_PLL_SYS_BASE_ADDRESS);
}

// --------------------------------------------------------------------------------

/**
 * @brief Configured frequency of all available clocks.
 * clock_driver_init() needs to be called. Otherwise this
 * array does not contain valid values.
 * 
 */
static u32 clock_configured_frequencies[RP2040_CLOCK_COUNT];

/**
 * @brief Get the configured frequency of the clock defined by index
 * 
 * @param index index of the clock of interesst
 * @return the actual configured frequencey of the clock
 */
static inline u32 clock_driver_get_frequency(u32 index) {
    return clock_configured_frequencies[index];
}

/**
 * @brief Sets the configured frequency of a clock
 * 
 * @param index index of the clock 
 * @param frequency frequency to set for the desired clock
 */
static inline void clock_driver_set_frequency(u32 index, u32 frequency) {
    clock_configured_frequencies[index] = frequency;
}

// --------------------------------------------------------------------------------

/**
 * @brief Initializes XOSC
 * 
 */
static void clock_driver_initialize_xosc(void) {

    // Assumes 1-15 MHz input, checked above.
    clock_driver_get_xosc_reg()->ctrl = RP2040_CLOCK_DRIVER_XOSC_CTRL_FREQ_RANGE_VALUE_1_15MHZ;

