smuuze/rpi_control_rp2040/src/driver/clock_driver_rp2040.c
    // Set xosc startup delay
    clock_driver_get_xosc_reg()->startup = RP2040_CLOCK_DRIVER_XOSC_STARTUP_DELAY;

    // Set the enable bit now that we have set freq range and startup delay
    cpu_atomic_bit_set(&clock_driver_get_xosc_reg()->ctrl, RP2040_CLOCK_DRIVER_XOSC_CTRL_ENABLE);

    // Wait for XOSC to be stable
    while( !(clock_driver_get_xosc_reg()->status & RP2040_CLOCK_DRIVER_XOSC_STATUS_STABLE) ) {
        //cpu_watch_forever_loop();
    }
}

// --------------------------------------------------------------------------------

/**
 * @brief 
 * 
 * @param pll 
 * @param refdiv 
 * @param vco_freq 
 * @param post_div1 
 * @param post_div2 
 */
static void clock_driver_initalize_pll(RP2040_CLOCK_PLL_REG* p_pll, u32 refdiv, u32 vco_freq, u32 post_div1, u32 post_div2) {

    u32 ref_mhz = XOSC_MHZ / refdiv;

    // What are we multiplying the reference clock by to get the vco freq
    // (The regs are called div, because you divide the vco output and compare it to the refclk)
    u32 fbdiv = vco_freq / MHZ(ref_mhz);

    // div1 feeds into div2 so if div1 is 5 and div2 is 2 then you get a divide by 10
    u32 pdiv = (post_div1 << RP2040_CLOCK_DRIVER_PLL_PRIM_POSTDIV1_LSB)
             | (post_div2 << RP2040_CLOCK_DRIVER_PLL_PRIM_POSTDIV2_LSB);

    // if (pll->cs & PLL_CS_LOCK_BITS) {
    //     if (refdiv == (pll->cs & PLL_CS_REFDIV_BITS)) {
    //         if (fbdiv == (pll->fbdiv_int & PLL_FBDIV_INT_BITS)) {
    //             if (pdiv == (pll->prim & (PLL_PRIM_POSTDIV1_BITS | PLL_PRIM_POSTDIV2_BITS))) {
    //                 // do not disrupt PLL that is already correctly configured and operating
    //                 return;
    //             }
    //         }
    //     }
    // }

    // Load VCO-related dividers before starting VCO
    p_pll->cs = refdiv;
    p_pll->fbdiv_int = fbdiv;

    // Turn on PLL
    cpu_atomic_bit_clear(
        &p_pll->pwr,
        RP2040_CLOCK_DRIVER_PLL_PWR_POWER_DOWN          // Main power
        | RP2040_CLOCK_DRIVER_PLL_PWR_VCO_POWER_DOWN    // VCO Power
    );  

    // Wait for PLL to lock
    while ( !(p_pll->cs & RP2040_CLOCK_DRIVER_PLL_CS_LOCK))  {
        cpu_watch_forever_loop();
    }

    // Set up post dividers
    p_pll->prim = pdiv;

    // Turn on post divider
    cpu_atomic_bit_clear(&p_pll->pwr, RP2040_CLOCK_DRIVERPLL_PWR_POSTDIVPD);
}

// --------------------------------------------------------------------------------

/**
 * @brief 
 * 
 * @param clk_index 
 * @param src 
 * @param auxsrc 
 * @param src_freq 
 * @param freq 
 */
static void clock_driver_configure_clock(u32 clk_index, u32 src, u32 auxsrc, u32 src_freq, u32 freq) {

    // Div register is 24.8 int.frac divider so multiply by 2^8 (left shift by 8)
    u32 div = (u32) (((u64) src_freq << 8) / freq);

    RP2040_CLOCK_CONTROL_REG* p_clock = &clock_driver_get_clock_reg()->clk[clk_index];

    // If increasing divisor, set divisor before source. Otherwise set source
    // before divisor. This avoids a momentary overspeed when e.g. switching
    // to a faster source and increasing divisor to compensate.
    if (div > p_clock->div) {
        p_clock->div = div;
    }

    if (RP2040_CLOCK_DRIVER_IS_GLITCHLESS_MUX(clk_index) && src == RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX) {

        // If switching a glitchless slice (ref or sys) to an aux source, switch
        // away from aux *first* to avoid passing glitches when changing aux mux.
        // Assume (!!!) glitchless source 0 is no faster than the aux source.

        cpu_atomic_bit_clear(&p_clock->ctrl, RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_BITS);
        while ( !(p_clock->selected & 1u) ) {
            cpu_watch_forever_loop();
        }

    } else {

        // If no glitchless mux, cleanly stop the clock to avoid glitches
        // propagating when changing aux mux. Note it would be a really bad idea
        // to do this on one of the glitchless clocks (clk_sys, clk_ref).

        // Disable clock. On clk_ref and clk_sys this does nothing,
        // all other clocks have the ENABLE bit in the same position.
        cpu_atomic_bit_clear(&p_clock->ctrl, RP2040_CLOCK_CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS);

        if (clock_driver_get_frequency(clk_index) > 0) {

            // Delay for 3 cycles of the target clock, for ENABLE propagation.
            // Note XOSC_COUNT is not helpful here because XOSC is not
            // necessarily running, nor is timer... so, 3 cycles per loop:

            u32 delay_cyc = clock_driver_get_frequency(RP2040_CLOCK_DRIVER_SRC_SYS) / clock_driver_get_frequency(clk_index) + 1;
            asm volatile (
                ".syntax unified \n\t"
                "1: \n\t"
                "subs %0, #1 \n\t"
                "bne 1b"
                : "+r" (delay_cyc)
            );
        }
    }

    // Set aux mux first, and then glitchless mux if this clock has one
    cpu_bit_replace(
        &p_clock->ctrl,
        (auxsrc << RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_AUXSRC_LSB),
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_AUXSRC_BITS
    );

    if (RP2040_CLOCK_DRIVER_IS_GLITCHLESS_MUX(clk_index)) {

        cpu_bit_replace(
            &p_clock->ctrl,
            src << RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_LSB,
            RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_BITS
        );

        while ( !(p_clock->selected & (1u << src)) ) {
            cpu_watch_forever_loop();
        }
    }

    // Enable clock. On clk_ref and clk_sys this does nothing,
    // all other clocks have the ENABLE bit in the same position.
    cpu_atomic_bit_set(&p_clock->ctrl, RP2040_CLOCK_CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS);

    // Now that the source is configured, we can trust that the user-supplied
    // divisor is a safe value.
    p_clock->div = div;

    // Store the configured frequency
    clock_driver_set_frequency(clk_index, (u32)(((u64) src_freq << 8) / div));
}

// --------------------------------------------------------------------------------

/**
 * @see clock_driver_interface.h#clock_driver_init
 * 
 */
void clock_driver_init(void) {

    // Start tick in watchdog
    // Important: This function also provides a tick reference to the timer
    clock_driver_get_watchdog_reg()->tick = XOSC_MHZ | WATCHDOG_REG_TICK_ENABLE;

    // Disable resus that may be enabled from previous software
    clock_driver_get_clock_reg()->resus_ctrl = 0;

