smuuze/rpi_control_rp2040/src/driver/clock_driver_rp2040.c
    // Enable the xosc
    clock_driver_initialize_xosc();

    // Before we touch PLLs, switch sys and ref cleanly away from their aux sources.
    cpu_atomic_bit_clear(
        &clock_driver_get_clock_reg()->clk[RP2040_CLOCK_DRIVER_SRC_SYS].ctrl,
        RP2040_CLOCK_DRIVER_SYS_CTRL_REG_SRC
    );

    while (clock_driver_get_clock_reg()->clk[RP2040_CLOCK_DRIVER_SRC_SYS].selected != 0x1) {
        cpu_watch_forever_loop();
    }

    cpu_atomic_bit_clear(
        &clock_driver_get_clock_reg()->clk[RP2040_CLOCK_DRIVER_SRC_REF].ctrl,
        RP2040_CLOCK_DRIVER_REF_CTRL_REG_SRC
    );

    while (clock_driver_get_clock_reg()->clk[RP2040_CLOCK_DRIVER_SRC_REF].selected != 0x1) {
        cpu_watch_forever_loop();
    }

    rp2040_reset_pll_sys();
    clock_driver_initalize_pll(
        clock_driver_get_sys_pll_reg(),
        1,          // refdiv,
        MHZ(1500), // vco_freq,
        6,          // post_div1,
        2           // post_div2
    );

    rp2040_reset_pll_usb();
    clock_driver_initalize_pll(
        clock_driver_get_usb_pll_reg(),
        1,          // refdiv,
        MHZ(1200), // vco_freq,
        5,          // post_div1,
        5           // post_div2
    );

    // Configure clocks

    // CLK_REF = XOSC (12MHz) / 1 = 12MHz
    clock_driver_configure_clock(
        RP2040_CLOCK_DRIVER_SRC_REF,
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC,
        0, // No aux mux
        MHZ(12),
        MHZ(12)
    );

    // CLK SYS = PLL SYS (125MHz) / 1 = 125MHz
    clock_driver_configure_clock(
        RP2040_CLOCK_DRIVER_SRC_SYS,
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
        MHZ(125),
        MHZ(125)
    );

    // CLK USB = PLL USB (48MHz) / 1 = 48MHz
    clock_driver_configure_clock(
        RP2040_CLOCK_DRIVER_SRC_USB,
        0, // No GLMUX
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
        MHZ(48),
        MHZ(48)
    );

    // CLK ADC = PLL USB (48MHZ) / 1 = 48MHz
    clock_driver_configure_clock(
        RP2040_CLOCK_DRIVER_SRC_ADC,
        0, // No GLMUX
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
        MHZ(48),
        MHZ(48)
    );

    // CLK RTC = PLL USB (48MHz) / 1024 = 46875Hz
    clock_driver_configure_clock(
        RP2040_CLOCK_DRIVER_SRC_RTC,
        0, // No GLMUX
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_RTC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
        MHZ(48),
        46875
    );

    // CLK PERI = clk_sys. Used as reference clock for Peripherals. No dividers so just select and enable
    // Normally choose clk_sys or clk_usb
    clock_driver_configure_clock(
        RP2040_CLOCK_DRIVER_SRC_PERI,
        0,
        RP2040_CLOCK_DRIVER_CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS,
        MHZ(125),
        MHZ(125)
    );
}

// --------------------------------------------------------------------------------

/**
 * @see rp2040_clock_frequencies.h#clock_driver_peripheral_clk_frequency
 */
u32 clock_driver_peripheral_clk_frequency(void) {
    return clock_driver_get_frequency(RP2040_CLOCK_DRIVER_SRC_PERI);
}

// --------------------------------------------------------------------------------
